/*#include <iostream>
using namespace std;
int main() {
	//数组：就是一个集合，里面存放了相同数据类型的元素
	//特点1：数组中的每个数据元素都是相同的数据类型
	//特点2：数组是由连续的内存位置组成的
	/*一维数组的三种定义方式
	1）数据类型	数组名[数组长度];
	可以使用遍历的方式来赋值
	2)数据类型	数组名[数组长度]={值1,值2,...}
	3)数据类型	数组名[]={值1,值2,值3,....}
	//第一种
int i;
int a[5];
//数组元素的小标是从0开始索引的
a[0] = 10;
a[1] = 20;
a[2] = 30;
cout << a[2] << endl;
//第二种
//如果在初始化数据时，没有全部填写完，会用0来填补剩余数据
int arr2[5] = { 10,20,30,40,50 };
for (i = 0; i < 5; i++)
{
	cout << arr2[i] << endl;
}
//第三种
int arr3[] = { 1,2,3,4,5,6,7,8,9 };

system("pause");
return 0;
}*/